{
  "blogs":[
    {
      "title": "JavAttack",
      "body": "This project is for my capstone course (4155) at UNCC. This was done in the Express Framework and is a simple coding game to help children and those inexperienced in any programming learn the Java programming language. Out of our group of 5, only one of us knew the framework well enough to get things start (not myself) and helped the rest of the group while they learned for themselves the basics and functionality of the framework. THIS IS CURRENTLY BEING DEVELOPED AND WILL BE UPDATED",
      "author": "School",
      "links": "https://github.com/rfritz2-uncc/JavAttack",
      "id": 7
    },
    {
      "title": "Budget Bites",
      "body": "This was a project for my software engineering course (3155) at UNCC. This project was a simple database/sorting program that allowed the user to filter through different styles of foods and their price range at the restaurants near campus. The group size was originally 4, but unfortunately one member dropped the class without informing us. This was completed through the difficult transition period of remote learning and collaborating with start of COVID-19. ",
      "author": "School",
      "links": "https://github.com/hjperschy/BudgetBites",
      "id": 8
    },
    {
      "title": "Ruby on Rails Intro Tutorial",
      "body": "This was made during the software engineering course (3155) at UNCC. This repository is just various assignments assigned to me in order to show I was taking an active role in learning Ruby on Rails.",
      "author": "School",
      "links": "https://github.com/rfritz2-uncc/ITSC3155_SPRING2019_rfritz2",
      "id": 9
    },
    {
      "title": "React Tutorial",
      "body": "This project is of me learning the React Framework taken what I already know about HTML/CSS/JS. I started this project due to being advised to be more normalized in frameworks. I discovered a YouTube tutorial that was 32 videos in all that covered the basics of the framework; those being dynamic values, click events, useState function, out putting lists, props, useEffect hooks, JSON servers, fetching data, making custom hooks, submit events, and programmatic redirects. The link to the series that I followed is on the GitHub repository page's description",
      "author": "Personal",
      "links": "https://github.com/ryanfritzc/reactTutorial",
      "id": 10
    },
    {
      "title": "React Resume",
      "body": "This is the project you are currently on! I was advised to be normalized with frameworks and also advised to start with React, to which I did! I watched a YouTube video series that showcased the basics of React, in which I implemented what I learned in that tutorial series for this project. There is more information on that tutorial in the project labeled React Tutorial.",
      "author": "Personal",
      "links": "https://github.com/ryanfritzc/personalWebsite",
      "id": 11
    }
  ]
}